In [74]:
import pandas as pd
import numpy as np
data=pd.DataFrame({"ID":["1","1","2","2","2"],
                  "Data":["01/01/2019","03/28/2019","04/01/2019","04/08/2019","04/15/2019"],
                  "expense":[560,600,450,1000,1200]})

In [92]:
data1=data[['expense']]
data1=data1.sort_values('expense').reset_index(drop=True)

In [119]:
data['rank'] = ['','' ,'' ,'' ,'' ]
i=0
while i < 5:
    data['rank'][i]=str(list(data1['expense']).index(data['expense'][i])+1)
    i = i+1
data

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  after removing the cwd from sys.path.

         Data ID  expense rank
0  01/01/2019  1      560    2
1  03/28/2019  1      600    3
2  04/01/2019  2      450    1
3  04/08/2019  2     1000    4
4  04/15/2019  2     1200    5

In [120]:
b=0
c=0
for a in range(5):
    d=int(data['ID'][a])
    if d==1:
        b=b+data['expense'][a]
    elif d==2:
        c=c+data['expense'][a]
data['total']=np.where(data['ID']=='1',b,c)
data

         Data ID  expense rank  total
0  01/01/2019  1      560    2   1160
1  03/28/2019  1      600    3   1160
2  04/01/2019  2      450    1   2650
3  04/08/2019  2     1000    4   2650
4  04/15/2019  2     1200    5   2650